[
  {
    "path": "posts/welcome/",
    "title": "Welcome to DataViz Blog",
    "description": "Welcome to our new blog, DataViz Blog. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Suling",
        "url": "femtochi@yahoo.com.sg"
      }
    ],
    "date": "2021-05-22",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-22T19:00:02+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-05-22-datavizmakeover-1/",
    "title": "DataVizMakeover 1",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Suling",
        "url": "femtochi@yahoo.com.sg"
      }
    ],
    "date": "2021-05-22",
    "categories": [],
    "contents": "\r\n1. Introduction\r\nInternational merchandise trade statistics are indicative of Singapore’s competitiveness in the global economic system. Our top trading countries, as consumers and producers, are important partners for economic growth and stabilty.\r\nIn this data visualisation makeover, we are tasked to explore and revise the stacked area chart created by data from the Department of Statistics, Singapore (DOS), for merchandise trade shown below.\r\nSource\r\n2. Evaluation of Original Visualisation\r\nWe start by exploring the original visualisation in terms of clarity and aesthetics.\r\n2.1 Clarity\r\nThe title of the graph is inaccurate and vague. Firstly, the title does not indicate if the these countries are top six in terms of Exports or Imports. Next, closer inspection of the dataset reveals that these countries are not top in terms of Exports or Imports.\r\nExports\r\nImports\r\n\r\n\r\nThere are two y-axes provided for each sub-plot and each y-axis is scaled differently for Exports and Imports, making it difficult to compare the country’s Exports and Imports. The y-axes are also scaled differently across the sub-plots, making comparisons between countries difficult.\r\nThe x-axes are not scaled proportionally for comparison. In particular, Japan has only one year’s of trade statistics displayed. The other countries has two year’s data but the different lengths of the x-axis makes Mainland China and Malaysia appear longer than the rest.\r\nThe label of the x-axes indicate months but only the years are shown. This makes it difficult to tell if there are missing dates in data that are causing the x-axis to be shorter for some countries.\r\nThe sub-graphs do not appear as if they are ordered in any meaningful way. Countries could be ordered from first to last to better reflect the title.\r\n2.2 Aesthetic\r\nThere is poor use of stacked area chart and colours. As there are many overlapping regions and they are coloured differently, it appears as if there are three measures for each sub-graph.\r\nThe sub-title of each sub-graph is not aligned to the center of each sub-graph.\r\nNo tick marks are used on the y-axes even though they are of a continuous numerical scale.\r\nThe x-axis is labeled at the start of each year instead of the middle even though it is for a categorical scale. This results in the graph appearing as if it spans from mid-2019 to mid-2021.\r\nThe title is of a smaller font size than the names of countries when it should be the emphasis for this visualization.\r\n3. Proposed Representation\r\nThe proposed design is as follows. \r\n3.1 Clarity\r\nTitle and sub-title Sets the context of the visualization. Since this is about trade, major events that have affected trade would be mentioned here to set the context to understanding the visualization. As the countries are not the top 6, we will just name them as the top countries.\r\nThe main panel shows a quick summary for easy comparison between countries across the two years. The right panel presents a detailed look into the trends which would be otherwise lost in the summarized view. To make the appearance less cluttered we will make use of the pop-up boxes to display the values of points of interest.\r\nX-axis showing both dates and countries allow for easy comparison across both dimensions.\r\nY-axis shows the relative value of Exports and Imports with their difference being the Balance of Trade. This allows reads to quickly assess which countries have contributed more in terms of overall trade balance.\r\nChoice of a Gantt bar chart shows the relationship between the variables in a simple summary. The detailed time series will show the impact of major events on trade and the trend lines for a more in depth understanding of each country.\r\n3.2 Aesthetic\r\nColour used to differentiate between Exports and Imports and bring attention the growth trends.\r\nA gradient colour for Balance of Trade allow for quick interpretation of positive or negative periods.\r\nSet the detailed time series graph to be smaller than the main summary to lend more emphasis to the summary.\r\nCoordinate the colours in both charts so that it is more intuitive to read and earlier to interpret the association between them.\r\nUse reference lines are used judicially to direct attention to what is important for comparison.\r\n4. Step-by-Step Guide\r\nData Cleaning\r\nOpen the data file in Excel. Extract only the relevant countries (Mainland China, Malaysia, United States, Taiwan, Japan and Hong Kong) for the period from 2019 Jan to 2020 Dec from both the Import and Export sheets. There are no missing values in the table. Save and close the Excel spreadsheet.\r\nIn Tableau, create a new workbook and click ‘Connect to Data’. Choose ‘file type’ then ‘file name’ and select our excel spreadsheet ‘viz1_clean.xlsx’. In the ‘Data Source’ tab, drag the table that we want (extracted Imports) into the workspace. \r\nOpen tab ‘Sheet 1’ and use Tableau to pivot the table, with ‘Measure Values’ in columns and ‘Variables’ in ‘Rows’.  Remove ‘CNT’ from ‘Measure Values’ by right-click and selecting ‘remove’. \r\nView the pivoted table by ‘Analysis’ > ‘View Data’. \r\nExport the data and save the file as “Import.csv”.\r\nRepeat steps 1 – 5 for Exports. Open the csv files in Excel, add a new column ‘Source’ to indicate if the data is for ‘Export’ or ‘Import’. \r\nReference lines are useful so that the reader can use that to do comparisons between the charts quickly in our trellis plot. We will find the value of average Import and Export values in Excel instead of Tableau as it is a fixed value and not a field. \r\nImport the cleaned dataset into Tableau. ## Create a Gantt Bar plot showing Export, Import and Balance of Trade by year\r\nThe datatype for ‘Date’ is incorrect. Change by clicking on the icon and selecting ‘date’. \r\nBalance of trade is the difference between the value of a country’s exports and imports and is useful for assessing how Singapore’s trade partners contributes to our country’s balance of payments. Create a new variable to show the balance of trade. In tab ‘Sheet 1’, from ‘Analysis’ > ‘Create Calculated Field’. \r\nAdd ‘Date’ to ‘Columns’. Right-click on ‘YEAR(Date)’ pill to change it to ‘MONTH(Date)’. \r\nDrag ‘Measure Values’ to ‘Rows’. In the ‘Measure Values’ panel, remove ‘CNT’ and SUM(Balance) by right-clicking and select ‘Remove’. The line graph is automatically selected. \r\nDrag ‘Measure Names’ to ‘Color’ in the ‘Marks’ panel so that the line graphs for Export and Import are coloured differently. \r\nClick on ‘color’ to customise the appearance of the line graph. \r\nDrag ‘Import’ to the front of ‘Measure Values’ in ‘Rows’. \r\nIn the ‘Marks’ panel, click on ‘SUM(Import)’. Change the plot type to ‘Gantt Bar’. Drag ‘Balance’ to ‘Color’ and also to ‘Size’. \r\nAs ‘Balance’ should reflect if the balance of trade for that period if positive or negative, we will customise the colour as follows: Click on ‘Color’ > ‘Edit Colors’.  Click on ‘Advanced’ and center the colour scale at 0 to reflect when there is positive or negative balance of trade. In the Gantt plot, red represents the period when Import exceeds Export, and blue when Export exceeds Import. \r\nWe will merge the two plots by clicking on ‘Measure Values’ in ‘Rows’ and selecting ‘Dual Axis’. Next, we will click on the y-axis on the right of the plot and select ‘Synchronize Axis’. \r\nAdd the reference line to show average Export and average Import. Right-click y-axis and select ‘Add Reference Line’. In the field ‘Value’, select ‘SUM(Import)’.  Select a dashed line to differentiate it from the line graph and select the same colour as Import.\r\nDrag ‘SUM(Export)’ to ‘Detail’ in the Marks panel for ‘SUM(Import)’. Right-click y-axis and select ‘Add Reference Line’. Set the parameters as follows:  Select a dashed line and match the colour to the line graph for Export. Repeat to obtain a reference line for Balance of Trade. \r\nFormat reference lines. Right click on ‘Average Exports’, select ‘Format’. In the pop-up panel, set as follows:  As the values from our source data are in thousand dollars, we will include ‘$’ prefix and ‘K’ suffix. Repeat for ‘Average Imports’ and ‘Average BOT’.\r\nFormat ‘Export’, ‘Import’ and ‘Balance’ similarly. For ‘Measure Values’ in the ‘Marks’ panel, right click on ‘SUM(Export)’. Select ‘Format’.  In the pop-up panel, select the ‘Pane’ tab. Set the values as currency as follows: \r\nSave and duplicate this as ‘Sheet 1(2)’. We will use ‘Sheet 1(2)’ to create a time series for each country.\r\nDrag ‘Country’ to ‘Columns’.\r\nClick on the y-axis ‘Import(Thousand Dollars)’ to sort in descending order.\r\nEdit ‘Tooltip’ for ‘SUM(Import)’ in Marks panel. Click on ‘tooltip’ and remove irrelevant fields. Append “$” and “K” to indicate that values are in thousands. \r\nTo improve the aesthetic, ‘SUM(Import)’ in ‘Marks’ pane, click ‘Size’ and increase the width of the bars.  Click ‘Color’ and reduce the opacity of the bars. \r\nRemove header by right-click ‘Year of Date/ Country’, select ‘Hide Field Labels for Columns’. \r\nAdd a proper title. Click on the title and in the ‘Edit Title’ pop-up box, add a title and format it. \r\nRight-click on the x-axis, select ‘Format’. Make country names more visible by increasing the font size.  In the ‘Columns’ tab, add vertical grid lines so that it will be easier to tell the countries apart. Match the appearance of the horizontal grid lines so that they will not detract from the plots. \r\nRename legend for ‘SUM(Balance)’ to ‘Balance of Trade’ using ‘Edit Title’. \r\nRename legend for ‘Measure Names’ to ‘Merchandise Trade’. \r\nTo show the percentage growth for Exports from 2019 to 2020. Drag ‘Export’ pill to ‘Rows’.  Click on ‘Export’, ‘Quick Table Calculation’ then ‘Percent Difference’.  Click on ‘Export’ again, select ‘Compute Using’ then ‘Date’.  Double-click on ‘Export’ pill and copy the formula.  Click ‘Analysis’, ‘Create Calculated Field’. Paste the formula. \r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-30T17:12:41+08:00",
    "input_file": "datavizmakeover-1.utf8.md"
  }
]
