[
  {
    "path": "posts/welcome/",
    "title": "Welcome to DataViz Blog",
    "description": "Welcome to our new blog, DataViz Blog. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Suling",
        "url": "femtochi@yahoo.com.sg"
      }
    ],
    "date": "2021-05-22",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-30T21:01:17+08:00",
    "input_file": "welcome.utf8.md"
  },
  {
    "path": "posts/2021-05-22-datavizmakeover-1/",
    "title": "DataVizMakeover 1",
    "description": "A Tableau tutorial for building a Gantt Chart and Time Series Data Visualisation Makeover",
    "author": [
      {
        "name": "Suling",
        "url": "femtochi@yahoo.com.sg"
      }
    ],
    "date": "2021-05-22",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1. Introduction\r\n2. Evaluation of Original Visualisation\r\n2.1 Clarity\r\n2.2 Aesthetic\r\n\r\n3. Proposed Representation\r\n3.1 Clarity\r\n3.2 Aesthetic\r\n\r\n4. Step-by-Step Guide\r\nData Cleaning\r\nCreate a Gantt Bar plot showing Export, Import and Balance of Trade by year\r\nCreate Timeseries for each country\r\nCreate a dashboard\r\n\r\n5.Derived Insights\r\n\r\n1. Introduction\r\nInternational merchandise trade statistics are indicative of Singapore’s competitiveness in the global economic system. Our top trading countries, as consumers and producers, are important partners for economic growth and stability.\r\nIn this data visualization makeover, we are tasked to explore and revise the stacked area chart created by data from the Department of Statistics, Singapore (DOS), for merchandise trade shown below.\r\nSource\r\n2. Evaluation of Original Visualisation\r\nWe start by exploring the original visualisation in terms of clarity and aesthetics.\r\n2.1 Clarity\r\nThe title of the graph is inaccurate and vague. Firstly, the title does not indicate if the these countries are top six in terms of Exports or Imports. Next, closer inspection of the dataset reveals that these countries are not top in terms of Exports or Imports.\r\nExports\r\nImports\r\n\r\n\r\nThere are two y-axes provided for each sub-plot and each y-axis is scaled differently for Exports and Imports, making it difficult to compare the country’s Exports and Imports. The y-axes are also scaled differently across the sub-plots, making comparisons between countries difficult.\r\nThe x-axes are not scaled proportionally for comparison. In particular, Japan has only one year’s of trade statistics displayed. The other countries has two year’s data but the different lengths of the x-axis makes Mainland China and Malaysia appear longer than the rest.\r\nThe label of the x-axes indicate months but only the years are shown. This makes it difficult to tell if there are missing dates in data that are causing the x-axis to be shorter for some countries.\r\nThe sub-graphs do not appear as if they are ordered in any meaningful way. Countries could be ordered from first to last to better reflect the title.\r\n2.2 Aesthetic\r\nThere is poor use of stacked area chart and colours. As there are many overlapping regions and they are coloured differently, it appears as if there are three measures for each sub-graph.\r\nThe sub-title of each sub-graph is not aligned to the center of each sub-graph.\r\nNo tick marks are used on the y-axes even though they are of a continuous numerical scale.\r\nThe x-axis is labeled at the start of each year instead of the middle even though it is for a categorical scale. This results in the graph appearing as if it spans from mid-2019 to mid-2021.\r\nThe title is of a smaller font size than the names of countries when it should be the emphasis for this visualization.\r\n3. Proposed Representation\r\nThe proposed design is as follows. \r\n3.1 Clarity\r\nThe title and subtitle sets the context of the visualization. Since this is about trade, major events that have affected trade will be mentioned here to set the context for understanding the visualization. As the countries are not the top 6, we will just name them as the top countries.\r\nThe main panel shows a quick summary for easy comparison between countries across the two years. The right panel presents a detailed look into the trends which would be otherwise lost in the summarized view. To make the appearance less cluttered we will make use of the pop-up boxes to display the values of points of interest.\r\nX-axis showing both dates and countries allow for easy comparison across both dimensions.\r\nY-axis shows the relative value of Exports and Imports with their difference being the Balance of Trade. This allows reads to quickly assess which countries have contributed more in terms of overall trade balance.\r\nChoice of a Gantt bar chart shows the relationship between the variables in a simple summary. The detailed time series will show the impact of major events on trade and the trend lines for a more in depth understanding of each country.\r\n3.2 Aesthetic\r\nColours are used to differentiate between Exports and Imports and bring attention to growth trends. Red and dark colours are used sparingly to focus the readers on key insights.\r\nA gradient colour for Balance of Trade allow for quick interpretation of positive or negative values.\r\nScale the detailed time series graph to be smaller than the main summary to lend more emphasis to the summary.\r\nCoordinate the colours in both charts so that it is more intuitive to understand and earlier to interpret the association between them.\r\nReference lines are used judicially to direct attention to what is important for comparison.\r\n4. Step-by-Step Guide\r\nData Cleaning\r\nOpen the data file in Excel. Extract only the relevant countries (Mainland China, Malaysia, United States, Taiwan, Japan and Hong Kong) for the period from 2019 Jan to 2020 Dec from both the Import and Export sheets. There are no missing values in the table. Save and close the Excel spreadsheet.\r\nIn Tableau, create a new workbook and click ‘Connect to Data’. Choose ‘file type’ then ‘file name’ and select our excel spreadsheet ‘viz1_clean.xlsx’. In the ‘Data Source’ tab, drag the table that we want (extracted Imports) into the workspace. \r\nOpen tab ‘Sheet 1’ and use Tableau to pivot the table, with ‘Measure Values’ in columns and ‘Variables’ in ‘Rows’.  Remove ‘CNT’ from ‘Measure Values’ by right-click and selecting ‘remove’. \r\nView the pivoted table by ‘Analysis’ > ‘View Data’. \r\nExport the data and save the file as “Import.csv”.\r\nRepeat steps 1 – 5 for Exports. Open the csv files in Excel, add a new column ‘Source’ to indicate if the data is for ‘Export’ or ‘Import’. \r\nReference lines are useful so that the reader can use that to do comparisons between the charts quickly in our trellis plot. We will find the value of average Import and Export values in Excel instead of Tableau as it is a fixed value and not a field. \r\nImport the cleaned dataset into Tableau.\r\nCreate a Gantt Bar plot showing Export, Import and Balance of Trade by year\r\nThe datatype for ‘Date’ is incorrect. Change by clicking on the icon and selecting ‘date’. \r\nBalance of trade is the difference between the value of a country’s exports and imports and is useful for assessing how Singapore’s trade partners contributes to our country’s balance of payments. Create a new variable to show the balance of trade. In tab ‘Sheet 1’, from ‘Analysis’ > ‘Create Calculated Field’. \r\nAdd ‘Date’ to ‘Columns’. Right-click on ‘YEAR(Date)’ pill to change it to ‘MONTH(Date)’. \r\nDrag ‘Measure Values’ to ‘Rows’. In the ‘Measure Values’ panel, remove ‘CNT’ and SUM(Balance) by right-clicking and select ‘Remove’. The line graph is automatically selected. \r\nDrag ‘Measure Names’ to ‘Color’ in the ‘Marks’ panel so that the line graphs for Export and Import are coloured differently. \r\nClick on ‘color’ to customise the appearance of the line graph. \r\nDrag ‘Import’ to the front of ‘Measure Values’ in ‘Rows’. \r\nIn the ‘Marks’ panel, click on ‘SUM(Import)’. Change the plot type to ‘Gantt Bar’. Drag ‘Balance’ to ‘Color’ and also to ‘Size’. \r\nAs ‘Balance’ should reflect if the balance of trade for that period if positive or negative, we will customise the colour as follows: Click on ‘Color’ > ‘Edit Colors’.  Click on ‘Advanced’ and center the colour scale at 0 to reflect when there is positive or negative balance of trade. In the Gantt plot, red represents the period when Import exceeds Export, and blue when Export exceeds Import. \r\nWe will merge the two plots by clicking on ‘Measure Values’ in ‘Rows’ and selecting ‘Dual Axis’. Next, we will click on the y-axis on the right of the plot and select ‘Synchronize Axis’. \r\nAdd the reference line to show average Export and average Import. Right-click y-axis and select ‘Add Reference Line’. In the field ‘Value’, select ‘SUM(Import)’.  Select a dashed line to differentiate it from the line graph and select the same colour as Import.\r\nDrag ‘SUM(Export)’ to ‘Detail’ in the Marks panel for ‘SUM(Import)’. Right-click y-axis and select ‘Add Reference Line’. Set the parameters as follows:  Select a dashed line and match the colour to the line graph for Export. Repeat to obtain a reference line for Balance of Trade. \r\nFormat reference lines. Right click on ‘Average Exports’, select ‘Format’. In the pop-up panel, set as follows:  As the values from our source data are in thousand dollars, we will include ‘$’ prefix and ‘K’ suffix. Repeat for ‘Average Imports’ and ‘Average BOT’.\r\nFormat ‘Export’, ‘Import’ and ‘Balance’ similarly. For ‘Measure Values’ in the ‘Marks’ panel, right click on ‘SUM(Export)’. Select ‘Format’.  In the pop-up panel, select the ‘Pane’ tab. Set the values as currency as follows: \r\nSave and duplicate this as ‘Sheet 1(2)’. We will use ‘Sheet 1(2)’ to create a time series for each country.\r\nDrag ‘Country’ to ‘Columns’.\r\nClick on the y-axis ‘Import(Thousand Dollars)’ to sort in descending order.\r\nEdit ‘Tooltip’ for ‘SUM(Import)’ in Marks panel. Click on ‘tooltip’ and remove irrelevant fields. Append “$” and “K” to indicate that values are in thousands. \r\nTo improve the aesthetic, ‘SUM(Import)’ in ‘Marks’ pane, click ‘Size’ and increase the width of the bars.  Click ‘Color’ and reduce the opacity of the bars. \r\nRemove header by right-click ‘Year of Date/ Country’, select ‘Hide Field Labels for Columns’. \r\nAdd a proper title. Click on the title and in the ‘Edit Title’ pop-up box, add a title and format it. \r\nRight-click on the x-axis, select ‘Format’. Make country names more visible by increasing the font size.  In the ‘Columns’ tab, add vertical grid lines so that it will be easier to tell the countries apart. Match the appearance of the horizontal grid lines so that they will not detract from the plots. \r\nRename legend for ‘SUM(Balance)’ to ‘Balance of Trade’ using ‘Edit Title’. \r\nRename legend for ‘Measure Names’ to ‘Merchandise Trade’. \r\nTo show the percentage growth for Exports from 2019 to 2020. Drag ‘Export’ pill to ‘Rows’.  Click on ‘Export’, ‘Quick Table Calculation’ then ‘Percent Difference’.  Click on ‘Export’ again, select ‘Compute Using’ then ‘Date’.  Double-click on ‘Export’ pill and copy the formula.  Click ‘Analysis’, ‘Create Calculated Field’. Paste the formula. \r\nApply a colour mask to show the difference between positive Export Growth and negative Export Growth for each country. Click ‘Analysis’, ‘Create Calculated Field’.  Repeat to create another field for ‘Negative Export Growth’:  Remove ‘SUM(Export)’ from ‘Rows’. The graph should look as before. In ‘Measure Values’ in the ‘Marks’ panel, drag both ‘Positive Export Growth’ and ‘Negative Export Growth’ to ‘Tooltips’. Add new formula for Export Growth and modify fields with changing colour.  In the ‘Marks’ panel, right-click on ‘Positive Export Growth’ and select ‘Format’. Change the format for ‘Numbers’ to reflect percentage as follows:  Repeats steps to change ‘Negative Export Growth’ to percentage as well. Next, we will repeat Steps 33 and 34 for Import Growth.\r\nFormat ‘Tooltip’ in ‘Measure Values’ using the same colour for Export fields and the same colour for Import Fields to make the visual association stronger. \r\nRight-click on the main graph area and select ‘Annotate’ then ‘Area’. Type insights and observations in the text area. Arrange, resize, or format the resulting text box if required. \r\nCite the data source in ‘Caption’. Click on ‘Caption’ and in ‘Edit Caption’ pop-up enter the following: \r\nCompleted worksheet: \r\nCreate Timeseries for each country\r\nThe Gantt bar is a clean and simple visual to quickly summarise and compare trade of each country over the two years. However, the impact of global events on trade can be better understood by their time series. Hence we will create a small panel to show the time series of each country.\r\nWe pick up our makeover from the duplicated worksheet ‘Sheet 1(2)’ created in Step 22. Drag ‘Country’ to ‘Rows’. \r\nVertical reference lines are useful for comparing across all the countries. We create them by first converting ‘MONTH(Date)’ in ‘Columns’ to ‘continuous’. \r\nTo create vertical reference lines for the years, right-click on the y-axis and select ‘Add Reference Line’.  Set the pop-up as follows to create a line that represents the start of 2019:  Choose ‘Per Pane’ as it will be distracting if the label is duplicated for each country. To format the line, we choose a dash type in grey to differentiate from the solid line used in the line graphs.  For ‘Reference Line Label’ we fix the year to the top of the chart using the customised alignment:  Repeat the steps to create another reference line at the start of 2020.\r\nCreate a reference line for COVID-19. From the time series, we observe that there are significant differences in trade around the start of 2020. The dips in the pattern of Exports and Imports are most obvious for China, United States and Malaysia. As these were also the countries deeply affected by the COVID-19 pandemic, we will insert a vertical reference line so that COVID-19 impact on trade is more obvious in the visualisation. 57  There were many significant events related to COVID-19 and trade globally. Since WHO declared COVID-19 a global pandemic on 11 March 2020, we will use this date to mark the period of global emergency. Right-click on the y-axis and select ‘Add Reference Line’. As shown before we will set the following for the reference line:  Select a red dashed line.  Right-click on ‘COVID-19’. Select ‘Format’ and match the colour of the label to the reference line.  Align the label to the centre of the graph to make it standout from the other reference lines. \r\nRemove the dates on the y-axis as the reference line provides sufficient context. Right click on the y-axis and de-select ‘Show Header’. \r\nCreate a title and explanations. Click on title to type and format a title to explain the graph. \r\nCompleted worksheet: \r\nCreate a dashboard\r\nWe use a dashboard to put two or more worksheets in the same visual. Click on the add Dashboard icon at the bottom. \r\nFor the ‘Dashboard’ tab on the left panel, drag the required worksheets to the workspace. \r\nPut the focus on the trade performance measure of the top countries by making it larger. Move the legends to the bottom of the graph. To show the link between graphs, standardize the colour for the same variable. In this case, we choose the colours used in the COVID-19 worksheet as the trend lines for Export and Imports are emphasized with the darker colours. Keep only one set of legend once the variables are coloured similarly.\r\nTry out different font sizes, colour and scale of the worksheets, formatting as required to put focus on the visualization that leads to the insights.\r\nPad the worksheets with blank whitespace around each chart to add emphasis. Drag ‘Blank’ from the ‘Objects’ panel to the gap between the two worksheets. \r\nAdd a title. Drag ‘Text’ from the ‘Objects’ panel to the top of the dashboard.  Double-click to add a title. \r\nThe completed Dashboard: \r\n5.Derived Insights\r\nA comparison between 2019 and 2020 shows that average Exports rose by 2.0% and average Imports fell by 2.8%. Although the rise in Exports was not significant, average Balance of Trade increased 64% in the same period. The large percentage rise is mainly due to the small 2018 Balance of Trade value and fall in Imports, rather than a rise in Exports. Hong Kong is the top net exporter, contributing the bulk of the positive Balance of Trade. Taiwan and the United States are significant net Importers, with Taiwan at the top. Singapore’s top trading countries are also major economic powers. The Global Economic slowdown, rise in trade protectionism and the COVID-19 pandemic have contributed to overall weaker trade environment globally in 2019 to 2020 and consequently Singapore’s trade is likewise affected.TodayOnline\r\nThe ranking of the top countries by Exports did not change from 2019 to 2020. Export growth to China, Japan and Hong Kong rose modestly below ~6% while Export growth to the United States and Taiwan rose significantly by more than ~12%. Malaysia was the only country where Export growth fell by a substantial ~18% from 2019 to 2020. The United States fell from 2nd to 4th in ranking for Imports. This resulted in the United States turning from net Importer to net Exporter from March 2020, registering a small positive Balance of Trade. Import growth were negative for China, Malaysia, United States and Japan, with the United States showing the most significant ~19% dip. This is perhaps due to the fall in consumption globally due to COVID-19 restrictions.Ministry of Trade & Industry\r\nOnce separated into individual timelines, trade differences between countries becomes more pronounced. While Exports fell, Imports to Malaysia rose only slightly at ~1% and this contributed to a negative balance of trade. Singapore is highly dependent on Malaysia for essential food supplies and demand rose during the early months of the COVID-19 pandemic due to stockpiling. On the other hand, Malaysia entered a lockdown in March 2020 due to the pandemic and the economy has yet to recover. Exports to Malaysia in 2020 remains flat and below 2019 levels. Exports to the United States shows fluctuations and this could be due to the changing demand for goods as the COVID-19 pandemic takes root in the country. China is Singapore’s top Exporter and Importer. As a major economic power, China’s Imports and Exports had dipped sharply in February 2020 when it entered a lockdown following the outbreak of COVID-19. Trade with China has since recovered in tandem with its economic recovery. Hong Kong and Taiwan trade registered the same growth trend throughout 2019 to 2020, with Taiwan growing faster. They were also least affected by COVID-19 and had kept infected low in their population. With a small and open economy that is highly dependent on trade, has since Singapore directed efforts into diversifying trade so that it is more resilient to disruptions in the global supply chain and levering on the demand of countries less affected by COVID-19 through trade pacts and partnerships. ChannelNewsAsia StraitsTimes\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-30T23:43:07+08:00",
    "input_file": "datavizmakeover-1.utf8.md"
  }
]
